Rhythm99/TARGET_B_L4S5I_IOT01A/PeripheralPins.c
{"payload":{"allShortcutsEnabled":true,"fileTree":{"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A":{"items":[{"name":"CMakeLists.txt","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/CMakeLists.txt","contentType":"file"},{"name":"PeripheralPins.c","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/PeripheralPins.c","contentType":"file"},{"name":"PinNames.h","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/PinNames.h","contentType":"file"}],"totalCount":3},"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI":{"items":[{"name":"TARGET_B_L4S5I_IOT01A","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A","contentType":"directory"},{"name":"TOOLCHAIN_ARM","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TOOLCHAIN_ARM","contentType":"directory"},{"name":"TOOLCHAIN_GCC_ARM","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TOOLCHAIN_GCC_ARM","contentType":"directory"},{"name":"TOOLCHAIN_IAR","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TOOLCHAIN_IAR","contentType":"directory"},{"name":"CMakeLists.txt","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/CMakeLists.txt","contentType":"file"},{"name":"cmsis_nvic.h","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/cmsis_nvic.h","contentType":"file"},{"name":"system_clock.c","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/system_clock.c","contentType":"file"}],"totalCount":7},"targets/TARGET_STM/TARGET_STM32L4":{"items":[{"name":"STM32Cube_FW","path":"targets/TARGET_STM/TARGET_STM32L4/STM32Cube_FW","contentType":"directory"},{"name":"TARGET_STM32L412xB","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L412xB","contentType":"directory"},{"name":"TARGET_STM32L432xC","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L432xC","contentType":"directory"},{"name":"TARGET_STM32L433xC","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L433xC","contentType":"directory"},{"name":"TARGET_STM32L443xC","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L443xC","contentType":"directory"},{"name":"TARGET_STM32L452xE","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L452xE","contentType":"directory"},{"name":"TARGET_STM32L471xG","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L471xG","contentType":"directory"},{"name":"TARGET_STM32L475xG","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L475xG","contentType":"directory"},{"name":"TARGET_STM32L476xG","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L476xG","contentType":"directory"},{"name":"TARGET_STM32L486xG","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L486xG","contentType":"directory"},{"name":"TARGET_STM32L496xG","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L496xG","contentType":"directory"},{"name":"TARGET_STM32L4P5xG","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4P5xG","contentType":"directory"},{"name":"TARGET_STM32L4R5xI","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4R5xI","contentType":"directory"},{"name":"TARGET_STM32L4R9xI","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4R9xI","contentType":"directory"},{"name":"TARGET_STM32L4S5xI","path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI","contentType":"directory"},{"name":"CMakeLists.txt","path":"targets/TARGET_STM/TARGET_STM32L4/CMakeLists.txt","contentType":"file"},{"name":"PeripheralNames.h","path":"targets/TARGET_STM/TARGET_STM32L4/PeripheralNames.h","contentType":"file"},{"name":"analogin_device.c","path":"targets/TARGET_STM/TARGET_STM32L4/analogin_device.c","contentType":"file"},{"name":"analogout_device.c","path":"targets/TARGET_STM/TARGET_STM32L4/analogout_device.c","contentType":"file"},{"name":"can_device.h","path":"targets/TARGET_STM/TARGET_STM32L4/can_device.h","contentType":"file"},{"name":"cmsis.h","path":"targets/TARGET_STM/TARGET_STM32L4/cmsis.h","contentType":"file"},{"name":"flash_api.c","path":"targets/TARGET_STM/TARGET_STM32L4/flash_api.c","contentType":"file"},{"name":"gpio_irq_device.c","path":"targets/TARGET_STM/TARGET_STM32L4/gpio_irq_device.c","contentType":"file"},{"name":"gpio_irq_device.h","path":"targets/TARGET_STM/TARGET_STM32L4/gpio_irq_device.h","contentType":"file"},{"name":"i2c_device.c","path":"targets/TARGET_STM/TARGET_STM32L4/i2c_device.c","contentType":"file"},{"name":"i2c_device.h","path":"targets/TARGET_STM/TARGET_STM32L4/i2c_device.h","contentType":"file"},{"name":"objects.h","path":"targets/TARGET_STM/TARGET_STM32L4/objects.h","contentType":"file"},{"name":"pin_device.h","path":"targets/TARGET_STM/TARGET_STM32L4/pin_device.h","contentType":"file"},{"name":"pwmout_device.c","path":"targets/TARGET_STM/TARGET_STM32L4/pwmout_device.c","contentType":"file"},{"name":"pwmout_device.h","path":"targets/TARGET_STM/TARGET_STM32L4/pwmout_device.h","contentType":"file"},{"name":"serial_device.c","path":"targets/TARGET_STM/TARGET_STM32L4/serial_device.c","contentType":"file"},{"name":"spi_api.c","path":"targets/TARGET_STM/TARGET_STM32L4/spi_api.c","contentType":"file"},{"name":"spi_device.h","path":"targets/TARGET_STM/TARGET_STM32L4/spi_device.h","contentType":"file"},{"name":"us_ticker_data.h","path":"targets/TARGET_STM/TARGET_STM32L4/us_ticker_data.h","contentType":"file"}],"totalCount":34},"targets/TARGET_STM":{"items":[{"name":"TARGET_STM32F0","path":"targets/TARGET_STM/TARGET_STM32F0","contentType":"directory"},{"name":"TARGET_STM32F1","path":"targets/TARGET_STM/TARGET_STM32F1","contentType":"directory"},{"name":"TARGET_STM32F2","path":"targets/TARGET_STM/TARGET_STM32F2","contentType":"directory"},{"name":"TARGET_STM32F3","path":"targets/TARGET_STM/TARGET_STM32F3","contentType":"directory"},{"name":"TARGET_STM32F4","path":"targets/TARGET_STM/TARGET_STM32F4","contentType":"directory"},{"name":"TARGET_STM32F7","path":"targets/TARGET_STM/TARGET_STM32F7","contentType":"directory"},{"name":"TARGET_STM32G0","path":"targets/TARGET_STM/TARGET_STM32G0","contentType":"directory"},{"name":"TARGET_STM32G4","path":"targets/TARGET_STM/TARGET_STM32G4","contentType":"directory"},{"name":"TARGET_STM32H7","path":"targets/TARGET_STM/TARGET_STM32H7","contentType":"directory"},{"name":"TARGET_STM32L0","path":"targets/TARGET_STM/TARGET_STM32L0","contentType":"directory"},{"name":"TARGET_STM32L1","path":"targets/TARGET_STM/TARGET_STM32L1","contentType":"directory"},{"name":"TARGET_STM32L4","path":"targets/TARGET_STM/TARGET_STM32L4","contentType":"directory"},{"name":"TARGET_STM32L5","path":"targets/TARGET_STM/TARGET_STM32L5","contentType":"directory"},{"name":"TARGET_STM32U5","path":"targets/TARGET_STM/TARGET_STM32U5","contentType":"directory"},{"name":"TARGET_STM32WB","path":"targets/TARGET_STM/TARGET_STM32WB","contentType":"directory"},{"name":"TARGET_STM32WL","path":"targets/TARGET_STM/TARGET_STM32WL","contentType":"directory"},{"name":"tools","path":"targets/TARGET_STM/tools","contentType":"directory"},{"name":"CMakeLists.txt","path":"targets/TARGET_STM/CMakeLists.txt","contentType":"file"},{"name":"PeripheralPins.h","path":"targets/TARGET_STM/PeripheralPins.h","contentType":"file"},{"name":"PinNamesTypes.h","path":"targets/TARGET_STM/PinNamesTypes.h","contentType":"file"},{"name":"PortNames.h","path":"targets/TARGET_STM/PortNames.h","contentType":"file"},{"name":"README.md","path":"targets/TARGET_STM/README.md","contentType":"file"},{"name":"USBPhyHw.h","path":"targets/TARGET_STM/USBPhyHw.h","contentType":"file"},{"name":"USBPhy_STM32.cpp","path":"targets/TARGET_STM/USBPhy_STM32.cpp","contentType":"file"},{"name":"analogin_api.c","path":"targets/TARGET_STM/analogin_api.c","contentType":"file"},{"name":"analogout_api.c","path":"targets/TARGET_STM/analogout_api.c","contentType":"file"},{"name":"can_api.c","path":"targets/TARGET_STM/can_api.c","contentType":"file"},{"name":"device.h","path":"targets/TARGET_STM/device.h","contentType":"file"},{"name":"gpio_api.c","path":"targets/TARGET_STM/gpio_api.c","contentType":"file"},{"name":"gpio_irq_api.c","path":"targets/TARGET_STM/gpio_irq_api.c","contentType":"file"},{"name":"gpio_object.h","path":"targets/TARGET_STM/gpio_object.h","contentType":"file"},{"name":"hal_tick_overrides.c","path":"targets/TARGET_STM/hal_tick_overrides.c","contentType":"file"},{"name":"i2c_api.c","path":"targets/TARGET_STM/i2c_api.c","contentType":"file"},{"name":"lp_ticker.c","path":"targets/TARGET_STM/lp_ticker.c","contentType":"file"},{"name":"lp_ticker_defines.h","path":"targets/TARGET_STM/lp_ticker_defines.h","contentType":"file"},{"name":"mbed_crc_api.c","path":"targets/TARGET_STM/mbed_crc_api.c","contentType":"file"},{"name":"mbed_overrides.c","path":"targets/TARGET_STM/mbed_overrides.c","contentType":"file"},{"name":"mbed_rtx.h","path":"targets/TARGET_STM/mbed_rtx.h","contentType":"file"},{"name":"nvic_addr.h","path":"targets/TARGET_STM/nvic_addr.h","contentType":"file"},{"name":"ospi_api.c","path":"targets/TARGET_STM/ospi_api.c","contentType":"file"},{"name":"pinmap.c","path":"targets/TARGET_STM/pinmap.c","contentType":"file"},{"name":"port_api.c","path":"targets/TARGET_STM/port_api.c","contentType":"file"},{"name":"pwmout_api.c","path":"targets/TARGET_STM/pwmout_api.c","contentType":"file"},{"name":"qspi_api.c","path":"targets/TARGET_STM/qspi_api.c","contentType":"file"},{"name":"reset_reason.c","path":"targets/TARGET_STM/reset_reason.c","contentType":"file"},{"name":"rtc_api.c","path":"targets/TARGET_STM/rtc_api.c","contentType":"file"},{"name":"rtc_api_hal.h","path":"targets/TARGET_STM/rtc_api_hal.h","contentType":"file"},{"name":"serial_api.c","path":"targets/TARGET_STM/serial_api.c","contentType":"file"},{"name":"serial_api_hal.h","path":"targets/TARGET_STM/serial_api_hal.h","contentType":"file"},{"name":"sleep.c","path":"targets/TARGET_STM/sleep.c","contentType":"file"},{"name":"stm32_assert.h","path":"targets/TARGET_STM/stm32_assert.h","contentType":"file"},{"name":"stm_i2c_api.h","path":"targets/TARGET_STM/stm_i2c_api.h","contentType":"file"},{"name":"stm_spi_api.c","path":"targets/TARGET_STM/stm_spi_api.c","contentType":"file"},{"name":"trng_api.c","path":"targets/TARGET_STM/trng_api.c","contentType":"file"},{"name":"us_ticker.c","path":"targets/TARGET_STM/us_ticker.c","contentType":"file"},{"name":"us_ticker_defines.h","path":"targets/TARGET_STM/us_ticker_defines.h","contentType":"file"},{"name":"watchdog_api.c","path":"targets/TARGET_STM/watchdog_api.c","contentType":"file"}],"totalCount":57},"targets":{"items":[{"name":"TARGET_ARM_FM","path":"targets/TARGET_ARM_FM","contentType":"directory"},{"name":"TARGET_ARM_SSG","path":"targets/TARGET_ARM_SSG","contentType":"directory"},{"name":"TARGET_Ambiq_Micro","path":"targets/TARGET_Ambiq_Micro","contentType":"directory"},{"name":"TARGET_Analog_Devices","path":"targets/TARGET_Analog_Devices","contentType":"directory"},{"name":"TARGET_Cypress","path":"targets/TARGET_Cypress","contentType":"directory"},{"name":"TARGET_Freescale","path":"targets/TARGET_Freescale","contentType":"directory"},{"name":"TARGET_GigaDevice","path":"targets/TARGET_GigaDevice","contentType":"directory"},{"name":"TARGET_Maxim","path":"targets/TARGET_Maxim","contentType":"directory"},{"name":"TARGET_NORDIC","path":"targets/TARGET_NORDIC","contentType":"directory"},{"name":"TARGET_NUVOTON","path":"targets/TARGET_NUVOTON","contentType":"directory"},{"name":"TARGET_NXP","path":"targets/TARGET_NXP","contentType":"directory"},{"name":"TARGET_RENESAS","path":"targets/TARGET_RENESAS","contentType":"directory"},{"name":"TARGET_STM","path":"targets/TARGET_STM","contentType":"directory"},{"name":"TARGET_Samsung","path":"targets/TARGET_Samsung","contentType":"directory"},{"name":"TARGET_Silicon_Labs","path":"targets/TARGET_Silicon_Labs","contentType":"directory"},{"name":"TARGET_TOSHIBA","path":"targets/TARGET_TOSHIBA","contentType":"directory"},{"name":"CMakeLists.txt","path":"targets/CMakeLists.txt","contentType":"file"},{"name":"targets.json","path":"targets/targets.json","contentType":"file"}],"totalCount":18},"":{"items":[{"name":".github","path":".github","contentType":"directory"},{"name":"TESTS","path":"TESTS","contentType":"directory"},{"name":"UNITTESTS","path":"UNITTESTS","contentType":"directory"},{"name":"cmsis","path":"cmsis","contentType":"directory"},{"name":"connectivity","path":"connectivity","contentType":"directory"},{"name":"docker_images","path":"docker_images","contentType":"directory"},{"name":"docs","path":"docs","contentType":"directory"},{"name":"drivers","path":"drivers","contentType":"directory"},{"name":"events","path":"events","contentType":"directory"},{"name":"extern","path":"extern","contentType":"directory"},{"name":"features","path":"features","contentType":"directory"},{"name":"hal","path":"hal","contentType":"directory"},{"name":"platform","path":"platform","contentType":"directory"},{"name":"rtos","path":"rtos","contentType":"directory"},{"name":"storage","path":"storage","contentType":"directory"},{"name":"targets","path":"targets","contentType":"directory"},{"name":"tools","path":"tools","contentType":"directory"},{"name":".astylerc","path":".astylerc","contentType":"file"},{"name":".codecheckignore","path":".codecheckignore","contentType":"file"},{"name":".coveragerc","path":".coveragerc","contentType":"file"},{"name":".editorconfig","path":".editorconfig","contentType":"file"},{"name":".gitattributes","path":".gitattributes","contentType":"file"},{"name":".gitignore","path":".gitignore","contentType":"file"},{"name":".lgtm.yml","path":".lgtm.yml","contentType":"file"},{"name":".mergify.yml","path":".mergify.yml","contentType":"file"},{"name":".pylintrc","path":".pylintrc","contentType":"file"},{"name":"CMakeLists.txt","path":"CMakeLists.txt","contentType":"file"},{"name":"CONTRIBUTING.md","path":"CONTRIBUTING.md","contentType":"file"},{"name":"DOXYGEN_FRONTPAGE.md","path":"DOXYGEN_FRONTPAGE.md","contentType":"file"},{"name":"Jenkinsfile","path":"Jenkinsfile","contentType":"file"},{"name":"LICENSE-apache-2.0.txt","path":"LICENSE-apache-2.0.txt","contentType":"file"},{"name":"LICENSE.md","path":"LICENSE.md","contentType":"file"},{"name":"README.md","path":"README.md","contentType":"file"},{"name":"doxyfile_options","path":"doxyfile_options","contentType":"file"},{"name":"doxygen_options.json","path":"doxygen_options.json","contentType":"file"},{"name":"logo.png","path":"logo.png","contentType":"file"},{"name":"mbed.h","path":"mbed.h","contentType":"file"},{"name":"requirements.txt","path":"requirements.txt","contentType":"file"}],"totalCount":38}},"fileTreeProcessingTime":23.636933,"foldersToFetch":[],"reducedMotionEnabled":"system","repo":{"id":8270972,"defaultBranch":"master","name":"mbed-os","ownerLogin":"ARMmbed","currentUserCanPush":false,"isFork":false,"isEmpty":false,"createdAt":"2013-02-18T20:53:11.000+05:30","ownerAvatar":"https://avatars.githubusercontent.com/u/8916057?v=4","public":true,"private":false,"isOrgOwned":true},"refInfo":{"name":"master","listCacheKey":"v0:1685623093.312078","canEdit":true,"refType":"branch","currentOid":"f9c0cd2a94fc1353946b321aad7f8bca2bfe1b40"},"path":"targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/PeripheralPins.c","currentUser":{"id":25277227,"login":"Rhythm99","userEmail":"rhythm_shah99@yahoo.com"},"blob":{"rawBlob":"/* mbed Microcontroller Library\n * SPDX-License-Identifier: BSD-3-Clause\n ******************************************************************************\n *\n * Copyright (c) 2016-2020 STMicroelectronics.\n * All rights reserved.\n *\n * This software component is licensed by ST under BSD 3-Clause license,\n * the \"License\"; You may not use this file except in compliance with the\n * License. You may obtain a copy of the License at:\n *                        opensource.org/licenses/BSD-3-Clause\n *\n ******************************************************************************\n *\n * Automatically generated from STM32CubeMX/db/mcu/STM32L4S5VITx.xml\n */\n\n#include \"PeripheralPins.h\"\n#include \"mbed_toolchain.h\"\n\n//==============================================================================\n// Notes\n//\n// - The pins mentioned Px_y_ALTz are alternative possibilities which use other\n//   HW peripheral instances. You can use them the same way as any other \"normal\"\n//   pin (i.e. PwmOut pwm(PA_7_ALT0);). These pins are not displayed on the board\n//   pinout image on mbed.org.\n//\n// - The pins which are connected to other components present on the board have\n//   the comment \"Connected to xxx\". The pin function may not work properly in this\n//   case. These pins may not be displayed on the board pinout image on mbed.org.\n//   Please read the board reference manual and schematic for more information.\n//\n// - Warning: pins connected to the default STDIO_UART_TX and STDIO_UART_RX pins are commented\n//   See https://os.mbed.com/teams/ST/wiki/STDIO for more information.\n//\n//==============================================================================\n\n\n//*** ADC ***\n\nMBED_WEAK const PinMap PinMap_ADC[] = {\n    {PA_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC1_IN5 // Connected to ARD_D1 [UART4_TX]\n    {PA_1,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 6, 0)}, // ADC1_IN6 // Connected to ARD_D0 [UART4_RX]\n    {PA_2,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 7, 0)}, // ADC1_IN7 // Connected to ARD_D10 [SPI_SSN]\n    {PA_3,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 8, 0)}, // ADC1_IN8 // Connected to ARD_D4\n    {PA_4,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)}, // ADC1_IN9 // Connected to ARD_D7\n    {PA_5,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 10, 0)}, // ADC1_IN10 // Connected to ARD_D13 [SPI1_SCK/LED1]\n    {PA_6,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 11, 0)}, // ADC1_IN11 // Connected to ARD_D12 [SPI1_MISO]\n    {PA_7,  