Rhythm99/TARGET_B_L4S5I_IOT01A/PeripheralPins.c
     USB_FS, STM_PIN_DATA(STM_MODE_INPUT, GPIO_NOPULL, GPIO_AF_NONE)}, // USB_OTG_FS_VBUS // Connected to USB_OTG_FS_VBUS\n    {PA_10,     USB_FS, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_OTG_FS_ID // Connected to USB_OTG_FS_ID\n    {PA_11,     USB_FS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_OTG_FS_DM // Connected to USB_OTG_FS_DM\n    {PA_12,     USB_FS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_OTG_FS_DP // Connected to USB_OTG_FS_DP\n//  {PA_13,     USB_FS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_OTG_FS_NOE\n//  {PA_14,     USB_FS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_OTG_FS_SOF\n//  {PC_9,      USB_FS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_OTG_FS_NOE // Connected to LED3_WIFI_ LED4_BLE\n    {NC, NC, 0}\n};\n","colorizedLines":null,"stylingDirectives":[[{"start":0,"end":31,"cssClass":"pl-c"}],[{"start":0,"end":40,"cssClass":"pl-c"}],[{"start":0,"end":79,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":46,"cssClass":"pl-c"}],[{"start":0,"end":23,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":72,"cssClass":"pl-c"}],[{"start":0,"end":73,"cssClass":"pl-c"}],[{"start":0,"end":52,"cssClass":"pl-c"}],[{"start":0,"end":62,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":79,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":68,"cssClass":"pl-c"}],[{"start":0,"end":3,"cssClass":"pl-c"}],[],[{"start":0,"end":8,"cssClass":"pl-k"},{"start":9,"end":27,"cssClass":"pl-s"}],[{"start":0,"end":8,"cssClass":"pl-k"},{"start":9,"end":27,"cssClass":"pl-s"}],[],[{"start":0,"end":80,"cssClass":"pl-c"}],[{"start":0,"end":8,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":79,"cssClass":"pl-c"}],[{"start":0,"end":81,"cssClass":"pl-c"}],[{"start":0,"end":81,"cssClass":"pl-c"}],[{"start":0,"end":30,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":79,"cssClass":"pl-c"}],[{"start":0,"end":83,"cssClass":"pl-c"}],[{"start":0,"end":81,"cssClass":"pl-c"}],[{"start":0,"end":79,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":94,"cssClass":"pl-c"}],[{"start":0,"end":70,"cssClass":"pl-c"}],[{"start":0,"end":2,"cssClass":"pl-c"}],[{"start":0,"end":80,"cssClass":"pl-c"}],[],[],[{"start":0,"end":13,"cssClass":"pl-c"}],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":33,"cssClass":"pl-s1"},{"start":36,"end":37,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":127,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":127,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":127,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":116,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":116,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"},{"start":83,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"},{"start":83,"end":131,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"},{"start":83,"end":131,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"},{"start":83,"end":130,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"},{"start":83,"end":118,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":122,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":122,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":122,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":122,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"},{"start":83,"end":124,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"},{"start":83,"end":124,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":42,"cssClass":"pl-s1"},{"start":45,"end":46,"cssClass":"pl-c1"}],[{"start":5,"end":13,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"}],[{"start":5,"end":13,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":75,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"}],[{"start":5,"end":13,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":76,"cssClass":"pl-c1"},{"start":78,"end":79,"cssClass":"pl-c1"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":13,"cssClass":"pl-c"}],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":33,"cssClass":"pl-s1"},{"start":36,"end":37,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":40,"cssClass":"pl-en"},{"start":41,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":72,"cssClass":"pl-c1"},{"start":74,"end":75,"cssClass":"pl-c1"},{"start":77,"end":78,"cssClass":"pl-c1"},{"start":82,"end":134,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":13,"cssClass":"pl-c"}],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":37,"cssClass":"pl-s1"},{"start":40,"end":41,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"}],[{"start":0,"end":112,"cssClass":"pl-c"}],[{"start":0,"end":112,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":123,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":123,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":115,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":111,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":118,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":136,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":37,"cssClass":"pl-s1"},{"start":40,"end":41,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":118,"cssClass":"pl-c"}],[{"start":0,"end":112,"cssClass":"pl-c"}],[{"start":0,"end":112,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":123,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":123,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":114,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":111,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":79,"cssClass":"pl-c1"},{"start":83,"end":116,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":13,"cssClass":"pl-c"}],[],[{"start":0,"end":60,"cssClass":"pl-c"}],[{"start":0,"end":60,"cssClass":"pl-c"}],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":33,"cssClass":"pl-s1"},{"start":36,"end":37,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":139,"cssClass":"pl-c"}],[{"start":0,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":139,"cssClass":"pl-c"}],[{"start":0,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":143,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"p