Rhythm99/TARGET_B_L4S5I_IOT01A/PeripheralPins.c
l-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":139,"cssClass":"pl-c"}],[{"start":0,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":142,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":128,"cssClass":"pl-c"}],[{"start":0,"end":128,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":131,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":145,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":146,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":144,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":142,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":142,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":144,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":137,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":105,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":140,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":129,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":128,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":129,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":105,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":105,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":157,"cssClass":"pl-c"}],[{"start":0,"end":135,"cssClass":"pl-c"}],[{"start":0,"end":139,"cssClass":"pl-c"}],[{"start":0,"end":135,"cssClass":"pl-c"}],[{"start":0,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":140,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":143,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":140,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":143,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":146,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":146,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":138,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":150,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":150,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":152,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":140,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":140,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"