Rhythm99/TARGET_B_L4S5I_IOT01A/PeripheralPins.c
},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":159,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":142,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":140,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":157,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":86,"cssClass":"pl-c1"},{"start":88,"end":89,"cssClass":"pl-c1"},{"start":91,"end":92,"cssClass":"pl-c1"},{"start":96,"end":144,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":144,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":160,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":161,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":149,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":152,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":151,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":156,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":154,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":22,"cssClass":"pl-c1"},{"start":25,"end":41,"cssClass":"pl-en"},{"start":42,"end":56,"cssClass":"pl-c1"},{"start":58,"end":69,"cssClass":"pl-c1"},{"start":71,"end":84,"cssClass":"pl-c1"},{"start":86,"end":87,"cssClass":"pl-c1"},{"start":89,"end":90,"cssClass":"pl-c1"},{"start":94,"end":155,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":16,"cssClass":"pl-c"}],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":37,"cssClass":"pl-s1"},{"start":40,"end":41,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"},{"start":87,"end":120,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":121,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":122,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":119,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":128,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":129,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":116,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":158,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"},{"start":87,"end":157,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"},{"start":87,"end":158,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":37,"cssClass":"pl-s1"},{"start":40,"end":41,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"},{"start":87,"end":120,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":110,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":111,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":129,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":128,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":116,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":159,"cssClass":"pl-c"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"},{"start":87,"end":158,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"},{"start":87,"end":118,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":135,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":38,"cssClass":"pl-s1"},{"start":41,"end":42,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":121,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":117,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"}],[{"start":5,"end":15,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"},{"start":88,"end":110,"cssClass":"pl-c"}],[{"start":5,"end":14,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":111,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":84,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":83,"cssClass":"pl-c1"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":25,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-en"},{"start":40,"end":54,"cssClass":"pl-c1"},{"start":56,"end":67,"cssClass":"pl-c1"},{"start":69,"end":85,"cssClass":"pl-c1"},{"start":89,"end":119,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":17,"end":23,"cssClass":"pl-c1"},{"start":27,"end":39,"cssClass":"pl-