Rhythm99/TARGET_B_L4S5I_IOT01A/PeripheralPins.c
"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":87,"cssClass":"pl-c1"},{"start":92,"end":156,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":39,"cssClass":"pl-s1"},{"start":42,"end":43,"cssClass":"pl-c1"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":87,"cssClass":"pl-c1"},{"start":92,"end":144,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":86,"cssClass":"pl-c1"},{"start":91,"end":132,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":87,"cssClass":"pl-c1"},{"start":92,"end":151,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":86,"cssClass":"pl-c1"},{"start":91,"end":181,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":87,"cssClass":"pl-c1"},{"start":92,"end":141,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":87,"cssClass":"pl-c1"},{"start":92,"end":156,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[],[],[{"start":0,"end":19,"cssClass":"pl-c"}],[],[{"start":0,"end":9,"cssClass":"pl-smi"},{"start":10,"end":15,"cssClass":"pl-k"},{"start":16,"end":22,"cssClass":"pl-s1"},{"start":23,"end":36,"cssClass":"pl-s1"},{"start":39,"end":40,"cssClass":"pl-c1"}],[{"start":0,"end":133,"cssClass":"pl-c"}],[{"start":5,"end":9,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":78,"cssClass":"pl-c1"},{"start":82,"end":132,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":82,"cssClass":"pl-c1"},{"start":86,"end":132,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":82,"cssClass":"pl-c1"},{"start":86,"end":132,"cssClass":"pl-c"}],[{"start":5,"end":10,"cssClass":"pl-c1"},{"start":16,"end":22,"cssClass":"pl-c1"},{"start":24,"end":36,"cssClass":"pl-en"},{"start":37,"end":51,"cssClass":"pl-c1"},{"start":53,"end":64,"cssClass":"pl-c1"},{"start":66,"end":82,"cssClass":"pl-c1"},{"start":86,"end":132,"cssClass":"pl-c"}],[{"start":0,"end":103,"cssClass":"pl-c"}],[{"start":0,"end":103,"cssClass":"pl-c"}],[{"start":0,"end":139,"cssClass":"pl-c"}],[{"start":5,"end":7,"cssClass":"pl-c1"},{"start":9,"end":11,"cssClass":"pl-c1"},{"start":13,"end":14,"cssClass":"pl-c1"}],[]],"csv":null,"csvError":null,"dependabotInfo":{"showConfigurationBanner":false,"configFilePath":null,"networkDependabotPath":"/ARMmbed/mbed-os/network/updates","dismissConfigurationNoticePath":"/settings/dismiss-notice/dependabot_configuration_notice","configurationNoticeDismissed":false,"repoAlertsPath":"/ARMmbed/mbed-os/security/dependabot","repoSecurityAndAnalysisPath":"/ARMmbed/mbed-os/settings/security_analysis","repoOwnerIsOrg":true,"currentUserCanAdminRepo":false},"displayName":"PeripheralPins.c","displayUrl":"https://github.com/ARMmbed/mbed-os/blob/master/targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/PeripheralPins.c?raw=true","headerInfo":{"blobSize":"38.2 KB","deleteInfo":{"deletePath":"https://github.com/ARMmbed/mbed-os/delete/master/targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/PeripheralPins.c","deleteTooltip":"Fork this repository and delete the file"},"editInfo":{"editTooltip":"Fork this repository and edit the file"},"ghDesktopPath":"https://desktop.github.com","gitLfsPath":null,"onBranch":true,"shortPath":"1e1ba1a","siteNavLoginPath":"/login?return_to=https%3A%2F%2Fgithub.com%2FARMmbed%2Fmbed-os%2Fblob%2Fmaster%2Ftargets%2FTARGET_STM%2FTARGET_STM32L4%2FTARGET_STM32L4S5xI%2FTARGET_B_L4S5I_IOT01A%2FPeripheralPins.c","isCSV":false,"isRichtext":false,"toc":null,"lineInfo":{"truncatedLoc":"464","truncatedSloc":"417"},"mode":"file"},"image":false,"isCodeownersFile":null,"isValidLegacyIssueTemplate":false,"issueTemplateHelpUrl":"https://docs.github.com/articles/about-issue-and-pull-request-templates","issueTemplate":null,"discussionTemplate":null,"language":"C","large":false,"loggedIn":true,"newDiscussionPath":"/ARMmbed/mbed-os/discussions/new","newIssuePath":"/ARMmbed/mbed-os/issues/new","planSupportInfo":{"repoIsFork":null,"repoOwnedByCurrentUser":null,"requestFullPath":"/ARMmbed/mbed-os/blob/master/targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/PeripheralPins.c","showFreeOrgGatedFeatureMessage":null,"showPlanSupportBanner":null,"upgradeDataAttributes":null,"upgradePath":null},"publishBannersInfo":{"dismissActionNoticePath":"/settings/dismiss-notice/publish_action_from_dockerfile","dismissStackNoticePath":"/settings/dismiss-notice/publish_stack_from_file","releasePath":"/ARMmbed/mbed-os/releases/new?marketplace=true","showPublishActionBanner":false,"showPublishStackBanner":false},"renderImageOrRaw":false,"richText":null,"renderedFileInfo":null,"tabSize":4,"topBannersInfo":{"overridingGlobalFundingFile":false,"globalPreferredFundingPath":null,"repoOwner":"ARMmbed","repoName":"mbed-os","showInvalidCitationWarning":false,"citationHelpUrl":"https://docs.github.com/en/github/creating-cloning-and-archiving-repositories/creating-a-repository-on-github/about-citation-files","showDependabotConfigurationBanner":false,"actionsOnboardingTip":null},"truncated":false,"viewable":true,"workflowRedirectUrl":null,"symbols":{"timedOut":false,"notAnalyzed":true,"symbols":[]}},"csrf_tokens":{"/ARMmbed/mbed-os/branches":{"post":"SjayakAvHAMeGodTwvYNIq3alEV-A92dwIJGZPo4QRdH7tGqegm-cWaSdGAF1KgXxb_xddSluZrhuaVkKQnwag"}}},"title":"mbed-os/targets/TARGET_STM/TARGET_STM32L4/TARGET_STM32L4S5xI/TARGET_B_L4S5I_IOT01A/PeripheralPins.c at master · ARMmbed/mbed-os","locale":"en"}